Catalogs/ПравилаАвтозаполненияФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ПравилаАвтозаполненияФайлов</Name>
			<Comment>Справочник правил автозаполнения шаблонов файлов</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВладелецФайла</Name>
					<Comment>Вид документа, для которого указывается настройка автозаполнения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВнутреннихДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыИсходящихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонФайла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеДляАвтозаполнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТермДляЗамены</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаменяемаяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеЗамены</Name>
							<Comment>Реквизит владельца файла, значение которого подставляется вместо терма для замены</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыражениеОбработкиРезультатаЗамены</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФорматЗначенияЗамены</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначенияЗамены</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитТабличнойЧасти</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКолонкиТабличнойЧасти</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеПоляЗамены</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>del_ра_СтрокаТЗ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПравилаЗаполненияТаблиц</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаполняемаяТаблица</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаменяемоеПоле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеЗаменыРеквизит</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеЗаменыВыражение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникДанныхДляЗамены</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПравилаАвтозаполненияФайлов/Ext/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Проверка на заполненность поля ВидДокумента
	Если НЕ ЗначениеЗаполнено(ВладелецФайла) Тогда
		ТекстСообщения = НСтр("ru = 'Поле ""Владелец файла"" не заполнено'; en = 'Field  ""File owner"" is not filled'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка, "Объект.ВладелецФайла", ,Отказ);
	КонецЕсли;	
	// ТСК Талько Э.Г.; 16.07.2018; Печать {
	ПроверитьТермыНаУникальность(Отказ);
	// ТСК Талько Э.Г.; 16.07.2018; Печать }
	
КонецПроцедуры

// ТСК Талько Э.Г.; 16.07.2018; Печать {
Процедура ПроверитьТермыНаУникальность(Отказ)
	
	Кэш = Новый Массив;
	Для каждого Строка Из ДанныеДляАвтозаполнения Цикл
		Если ЗначениеЗаполнено(Строка.ВыражениеОбработкиРезультатаЗамены)
			И СтрНайти(Строка.ВыражениеОбработкиРезультатаЗамены, "ра_СлужебныйПараметрДляТЗ") > 0 Тогда
			МассивКолонок = ра_ОбщегоНазначения.ПолучитьМассивКолонокТаблицыИзВыраженияСкрипта(Строка.ВыражениеОбработкиРезультатаЗамены, "СозданиеШаблона");
			
			Для Каждого Колонка ИЗ МассивКолонок Цикл
				Если Кэш.Найти(СокрЛП(Колонка.Имя)) <> Неопределено Тогда
					ТекстСообщения = НСтр("ru = 'Повторяющийся терм для замены ""%1""'; en = 'Repeating term for replacement ""%1""'");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(ТекстСообщения, СокрЛП(Колонка.Имя)), ЭтотОбъект,,, Отказ);
				Иначе
					Кэш.Добавить(СокрЛП(Колонка.Имя));
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ЗначениеЗаполнено(Строка.ТермДляЗамены) Тогда
			Если Кэш.Найти(СокрЛП(Строка.ТермДляЗамены)) <> Неопределено Тогда
				ТекстСообщения = НСтр("ru = 'Повторяющийся терм для замены ""%1""'; en = 'Repeating term for replacement ""%1""'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(ТекстСообщения, СокрЛП(Строка.ТермДляЗамены)), ЭтотОбъект,,, Отказ);
			Иначе
				Кэш.Добавить(СокрЛП(Строка.ТермДляЗамены));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
// ТСК Талько Э.Г.; 16.07.2018; Печать }
